In [3]:
import pandas as pd

In [7]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vaness','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT   Vaness    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
x=df.groupby('Company')  ## Baw7ad el columns
x  ## Howa 3mal Grouping bas msh haye3raf ye3redo bsbb el person bas 2aly 3la mkano fy el memory

In [16]:
x.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [18]:
x.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Company    6 non-null object
Person     6 non-null object
Sales      6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [23]:
data_frame1=pd.read_csv('example')   ## Lw el file mawgood fy nafs el folder m3 el notebook akteb esmo bas
data_frame1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
data_frame2=pd.read_excel('Excel_Sample.xlsx')   ## Lw el file mawgood fy nafs el folder m3 el notebook akteb esmo bas
data_frame2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Search about reading a html file by pandas